ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC7_I2CC_1.0.xml
    <register id="UC7_I2CC_TIMEOUT_CNT" width="32" offset="0x1150" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC7_I2CC_TIMEOUT_CTL" width="32" offset="0x1154" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>

</module>